Terraform plan for __dev__
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.layout-master-change.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "**************"
      + skip_delete         = (known after apply)
    }

  # module.layout-master-change.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-dev-321910"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.layout-master-change.google_pubsub_subscription.push_subscriptions["layout-master-change-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "layout-master-change-push"
      + project                    = "ebo-dev-321910"
      + topic                      = "layout-master-change"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-dev-321910/topics/layout-master-change-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.layout-master-change.google_pubsub_subscription_iam_member.push_subscription_binding["layout-master-change-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "layout-master-change-push"
    }

  # module.layout-master-change.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "layout-master-change"
      + project = "ebo-dev-321910"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.layout-master-change.google_pubsub_topic_iam_member.push_topic_binding["layout-master-change-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-dev-321910"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-dev-321910/topics/layout-master-change-dl"
    }

  # module.layout-master-change-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-dev-321910"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.layout-master-change-dl.google_pubsub_subscription.pull_subscriptions["layout-master-change-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "layout-master-change-dl-error"
      + project                    = "ebo-dev-321910"
      + topic                      = "layout-master-change-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.layout-master-change-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["layout-master-change-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "layout-master-change-dl-error"
    }

  # module.layout-master-change-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "layout-master-change-dl"
      + project = "ebo-dev-321910"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.layout-master-change-dl.google_pubsub_topic_iam_member.pull_topic_binding["layout-master-change-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-dev-321910"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-dev-321910/topics/layout-master-change-dl"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #487](https://github.com/ebomart/commerce-infrastructure/actions/runs/1979458628)